OpenFOAM-2.3.x/tutorials/incompressible/pimpleFoam/elipsekkLOmega/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 1e-5;

boundaryField
{
    inlet
    {
        type           fixedValue;
        value          $internalField;
    }
    outlet
    {
       type            inletOutlet;
       inletValue      $internalField;
       value           $internalField;
    }
    up
    {
        type           symmetry;
    }
    hole
    {
        type           fixedValue;
        value          $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
